{
  "last_updated": "2025-10-27T08:30:09.304054",
  "total_papers": 2,
  "papers": [
    {
      "title": "Remote Autonomy for Multiple Small Lowcost UAVs in GNSS-denied Search\n  and Rescue Operations",
      "summary": "In recent years, consumer-grade UAVs have been widely adopted by first\nresponders. In general, they are operated manually, which requires trained\npilots, especially in unknown GNSS-denied environments and in the vicinity of\nstructures. Autonomous flight can facilitate the application of UAVs and reduce\noperator strain. However, autonomous systems usually require special\nprogramming interfaces, custom sensor setups, and strong onboard computers,\nwhich limits a broader deployment.\n  We present a system for autonomous flight using lightweight consumer-grade\nDJI drones. They are controlled by an Android app for state estimation and\nobstacle avoidance directly running on the UAV's remote control. Our ground\ncontrol station enables a single operator to configure and supervise multiple\nheterogeneous UAVs at once. Furthermore, it combines the observations of all\nUAVs into a joint 3D environment model for improved situational awareness.",
      "published": "2025-10-24T11:36:07Z",
      "authors": [
        "Daniel Schleich",
        "Jan Quenzel",
        "Sven Behnke"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2510.21357v1",
      "pdf_link": "https://arxiv.org/pdf/2510.21357v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2510.21357v1",
      "relevance_score": 1
    },
    {
      "title": "Track-to-Track Association for Collective Perception based on Stochastic\n  Optimization",
      "summary": "Collective perception is a key aspect for autonomous driving in smart cities\nas it aims to combine the local environment models of multiple intelligent\nvehicles in order to overcome sensor limitations. A crucial part of\nmulti-sensor fusion is track-to-track association. Previous works often suffer\nfrom high computational complexity or are based on heuristics. We propose an\nassociation algorithms based on stochastic optimization, which leverages a\nmultidimensional likelihood incorporating the number of tracks and their\nspatial distribution and furthermore computes several association hypotheses.\nWe demonstrate the effectiveness of our approach in Monte Carlo simulations and\na realistic collective perception scenario computing high-likelihood\nassociations in ambiguous settings.",
      "published": "2025-10-24T09:24:14Z",
      "authors": [
        "Laura M. Wolf",
        "Vincent Albert Wolff",
        "Simon Steuernagel",
        "Kolja Thormann",
        "Marcus Baum"
      ],
      "categories": [
        "eess.SP",
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2510.21278v1",
      "pdf_link": "https://arxiv.org/pdf/2510.21278v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2510.21278v1",
      "relevance_score": 1
    }
  ],
  "search_keywords": [
    "perception-driven control",
    "adaptive control",
    "learning-based control",
    "sensorimotor learning",
    "physical intelligence",
    "robot learning",
    "adaptive robotics",
    "dynamic modeling",
    "sensor fusion",
    "contact-rich manipulation",
    "tactile perception",
    "force control",
    "impedance control",
    "contact dynamics",
    "interaction control",
    "embedded robotics",
    "real-time control",
    "resource-efficient robotics",
    "state estimation",
    "kalman filter",
    "closed-loop control",
    "perception and control",
    "model-based reinforcement learning",
    "uncertain dynamics",
    "multi-modal sensing",
    "actuation feedback"
  ]
}