{
  "last_updated": "2025-12-01T08:34:22.398228",
  "total_papers": 11,
  "papers": [
    {
      "title": "An AI-Enabled Hybrid Cyber-Physical Framework for Adaptive Control in Smart Grids",
      "summary": "Evolving smart grids require flexible and adaptive control methods. A harmonized hybrid cyber-physical framework, which considers both physical and cyber layers and ensures adaptability, is one of the critical challenges to enable sustainable and scalable smart grids. This paper proposes a three-layer (physical, cyber, control) architecture, with an energy management system as the core of the system. Adaptive Dynamic Programming(ADP) and Artificial Intelligence-based optimization techniques are used for sustainability and scalability. The deployment is considered under two contingencies: Cloud Independent and cloud-assisted. They allow us to test the proposed model under a low-latency localized decision scenario and also under a centralized control scenario. The architecture is simulated on a standard IEEE 33-Bus system, yielding positive results. The proposed framework can ensure grid stability, optimize dispatch, and respond to ever-changing grid dynamics.",
      "published": "2025-11-26T17:08:06Z",
      "authors": [
        "Muhammad Siddique",
        "Sohaib Zafar"
      ],
      "categories": [
        "cs.LG"
      ],
      "link": "https://arxiv.org/abs/2511.21590v2",
      "pdf_link": "https://arxiv.org/pdf/2511.21590v2.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.21590v2",
      "relevance_score": 3
    },
    {
      "title": "Power System Robust State Estimation As a Layer: A Novel End-to-end Learning Approach",
      "summary": "Serving as an essential prerequisite for modern power system operation, robust state estimation (RSE) could effectively resist noises and outliers in measurements. The emerging neural network (NN) based end-to-end (E2E) learning framework enables real-time application of RSE but cannot strictly enforce the physical constraints involved, potentially yielding solutions that are statistically accurate yet physically inconsistent. To bridge this gap, this work proposes a novel E2E learning based RSE framework, where the RSE problem is innovatively constructed as an explicit differentiable layer of NN for the first time, ensuring physics alignments with rigors. Also, the measurement weights are treated as learnable parameters of NN to enhance estimation robustness. A hybrid loss function is formulated to pursue accurate and physically consistent solutions. To realize the proposed NN structure, the original non-convex RSE problem is specially relaxed. Extensive numerical simulations have been carried out to demonstrate that the proposed framework can significantly improve the SE performance while fulfilling physical consistency on six testing systems, in comparisons to the classical E2E learning based approach and the physics-informed neural network (PINN) approach.",
      "published": "2025-11-28T02:02:29Z",
      "authors": [
        "Yibo Ding",
        "Wenzhuo Shi",
        "Mengzhao Duan",
        "Yuhong Zhao",
        "Jiaqi Ruan",
        "Jian Zhao",
        "Zhao Xu"
      ],
      "categories": [
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.22836v1",
      "pdf_link": "https://arxiv.org/pdf/2511.22836v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.22836v1",
      "relevance_score": 3
    },
    {
      "title": "Closed-Loop Control Law for Low Thrust Orbit Transfer with Guaranteed Stability",
      "summary": "Electric propulsion is used to maximize payload capacity in communication satellites. These orbit raising maneuvers span several months and hundreds of revolutions, making trajectory design a complex challenge. The literature typically addresses this problem using feedback laws, with Q-law being one of the most prominent approaches. However, Q-law suffers from closed-loop stability issues, limiting its suitability for real-time on-board implementation. In this work, we focus on closed-loop orbit raising rather than offline trajectory planning and address the stability limitations of the Q-law through a Lyapunov based control design. A Lyapunov-guided modification of the classical Q-law is proposed to ensure closed-loop stability and enable real-time implementation. The effectiveness of the proposed method is demonstrated through closed-loop orbit transfers across various scenarios, including co-planar transfers, equatorial to polar orbit transfers, and geostationary transfer orbit (GTO) to geostationary earth orbit (GEO) transfers.",
      "published": "2025-11-28T09:28:51Z",
      "authors": [
        "Suraj Kumar",
        "Aditya Rallapalli",
        "Nivriti Priyadarshini",
        "Bharat Kumar GVP",
        "Ravi Kumar L"
      ],
      "categories": [
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.23014v1",
      "pdf_link": "https://arxiv.org/pdf/2511.23014v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.23014v1",
      "relevance_score": 2
    },
    {
      "title": "SafeHumanoid: VLM-RAG-driven Control of Upper Body Impedance for Humanoid Robot",
      "summary": "Safe and trustworthy Human Robot Interaction (HRI) requires robots not only to complete tasks but also to regulate impedance and speed according to scene context and human proximity. We present SafeHumanoid, an egocentric vision pipeline that links Vision Language Models (VLMs) with Retrieval-Augmented Generation (RAG) to schedule impedance and velocity parameters for a humanoid robot. Egocentric frames are processed by a structured VLM prompt, embedded and matched against a curated database of validated scenarios, and mapped to joint-level impedance commands via inverse kinematics. We evaluate the system on tabletop manipulation tasks with and without human presence, including wiping, object handovers, and liquid pouring. The results show that the pipeline adapts stiffness, damping, and speed profiles in a context-aware manner, maintaining task success while improving safety. Although current inference latency (up to 1.4 s) limits responsiveness in highly dynamic settings, SafeHumanoid demonstrates that semantic grounding of impedance control is a viable path toward safer, standard-compliant humanoid collaboration.",
      "published": "2025-11-28T15:58:26Z",
      "authors": [
        "Yara Mahmoud",
        "Jeffrin Sam",
        "Nguyen Khang",
        "Marcelino Fernando",
        "Issatay Tokmurziyev",
        "Miguel Altamirano Cabrera",
        "Muhammad Haris Khan",
        "Artem Lykov",
        "Dzmitry Tsetserukou"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.23300v1",
      "pdf_link": "https://arxiv.org/pdf/2511.23300v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.23300v1",
      "relevance_score": 1
    },
    {
      "title": "Adaptive Factor Graph-Based Tightly Coupled GNSS/IMU Fusion for Robust Positionin",
      "summary": "Reliable positioning in GNSS-challenged environments remains a critical challenge for navigation systems. Tightly coupled GNSS/IMU fusion improves robustness but remains vulnerable to non-Gaussian noise and outliers. We present a robust and adaptive factor graph-based fusion framework that directly integrates GNSS pseudorange measurements with IMU preintegration factors and incorporates the Barron loss, a general robust loss function that unifies several m-estimators through a single tunable parameter. By adaptively down weighting unreliable GNSS measurements, our approach improves resilience positioning. The method is implemented in an extended GTSAM framework and evaluated on the UrbanNav dataset. The proposed solution reduces positioning errors by up to 41% relative to standard FGO, and achieves even larger improvements over extended Kalman filter (EKF) baselines in urban canyon environments. These results highlight the benefits of Barron loss in enhancing the resilience of GNSS/IMU-based navigation in urban and signal-compromised environments.",
      "published": "2025-11-28T09:33:13Z",
      "authors": [
        "Elham Ahmadi",
        "Alireza Olama",
        "Petri Välisuo",
        "Heidi Kuusniemi"
      ],
      "categories": [
        "cs.RO",
        "cs.LG"
      ],
      "link": "https://arxiv.org/abs/2511.23017v1",
      "pdf_link": "https://arxiv.org/pdf/2511.23017v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.23017v1",
      "relevance_score": 1
    },
    {
      "title": "Language-conditioned world model improves policy generalization by reading environmental descriptions",
      "summary": "To interact effectively with humans in the real world, it is important for agents to understand language that describes the dynamics of the environment--that is, how the environment behaves--rather than just task instructions specifying \"what to do\". Understanding this dynamics-descriptive language is important for human-agent interaction and agent behavior. Recent work address this problem using a model-based approach: language is incorporated into a world model, which is then used to learn a behavior policy. However, these existing methods either do not demonstrate policy generalization to unseen games or rely on limiting assumptions. For instance, assuming that the latency induced by inference-time planning is tolerable for the target task or expert demonstrations are available. Expanding on this line of research, we focus on improving policy generalization from a language-conditioned world model while dropping these assumptions. We propose a model-based reinforcement learning approach, where a language-conditioned world model is trained through interaction with the environment, and a policy is learned from this model--without planning or expert demonstrations. Our method proposes Language-aware Encoder for Dreamer World Model (LED-WM) built on top of DreamerV3. LED-WM features an observation encoder that uses an attention mechanism to explicitly ground language descriptions to entities in the observation. We show that policies trained with LED-WM generalize more effectively to unseen games described by novel dynamics and language compared to other baselines in several settings in two environments: MESSENGER and MESSENGER-WM.To highlight how the policy can leverage the trained world model before real-world deployment, we demonstrate the policy can be improved through fine-tuning on synthetic test trajectories generated by the world model.",
      "published": "2025-11-28T06:13:27Z",
      "authors": [
        "Anh Nguyen",
        "Stefan Lee"
      ],
      "categories": [
        "cs.CL",
        "cs.LG"
      ],
      "link": "https://arxiv.org/abs/2511.22904v1",
      "pdf_link": "https://arxiv.org/pdf/2511.22904v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.22904v1",
      "relevance_score": 1
    },
    {
      "title": "Predictive Safety Shield for Dyna-Q Reinforcement Learning",
      "summary": "Obtaining safety guarantees for reinforcement learning is a major challenge to achieve applicability for real-world tasks. Safety shields extend standard reinforcement learning and achieve hard safety guarantees. However, existing safety shields commonly use random sampling of safe actions or a fixed fallback controller, therefore disregarding future performance implications of different safe actions. In this work, we propose a predictive safety shield for model-based reinforcement learning agents in discrete space. Our safety shield updates the Q-function locally based on safe predictions, which originate from a safe simulation of the environment model. This shielding approach improves performance while maintaining hard safety guarantees. Our experiments on gridworld environments demonstrate that even short prediction horizons can be sufficient to identify the optimal path. We observe that our approach is robust to distribution shifts, e.g., between simulation and reality, without requiring additional training.",
      "published": "2025-11-26T15:59:55Z",
      "authors": [
        "Jin Pin",
        "Krasowski Hanna",
        "Vanneaux Elena"
      ],
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.21531v1",
      "pdf_link": "https://arxiv.org/pdf/2511.21531v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.21531v1",
      "relevance_score": 1
    },
    {
      "title": "Gated KalmaNet: A Fading Memory Layer Through Test-Time Ridge Regression",
      "summary": "As efficient alternatives to softmax Attention, linear state-space models (SSMs) achieve constant memory and linear compute, but maintain only a lossy, fading summary of the past, often leading to inferior performance in recall oriented tasks. We propose Gated KalmaNet (GKA), a layer that reduces this gap by accounting for the full past when predicting the next token, while maintaining SSM-style efficiency. GKA achieves this by solving an online ridge regression problem at test time, with constant memory and linear compute cost in the sequence length. Drawing inspiration from the Kalman Filter, we iteratively solve the online ridge regression problem. However, a critical insight is that standard Kalman filter equations are numerically unstable in low-precision environments (like bfloat16) and difficult to parallelize in modern hardware. We address both challenges through two key innovations: (1) an adaptive regularization strategy with input-dependent gating that controls the condition number of the ridge regression, ensuring numerical stability while balancing memory retention. And (2) the use of Chebyshev Iteration instead of other conventional iterative solvers, which we demonstrate to be more stable in low-precision settings. To further improve scalability, we develop a hardware-aware chunk-wise implementation of Chebyshev Iteration along with custom kernels for backpropagating through our adaptive regularization and gating mechanisms. Empirically, GKA shows strong language understanding capabilites on short-context tasks outperforming existing SSM layers (like Mamba2, GLA and Gated DeltaNet). On long-context, GKA excels at real-world RAG and LongQA tasks up to 128k tokens, achieving more than $10$% relative improvement over other fading memory baselines.",
      "published": "2025-11-26T03:26:37Z",
      "authors": [
        "Liangzu Peng",
        "Aditya Chattopadhyay",
        "Luca Zancato",
        "Elvis Nunez",
        "Wei Xia",
        "Stefano Soatto"
      ],
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "link": "https://arxiv.org/abs/2511.21016v1",
      "pdf_link": "https://arxiv.org/pdf/2511.21016v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.21016v1",
      "relevance_score": 1
    },
    {
      "title": "NOIR 2.0: Neural Signal Operated Intelligent Robots for Everyday Activities",
      "summary": "Neural Signal Operated Intelligent Robots (NOIR) system is a versatile brain-robot interface that allows humans to control robots for daily tasks using their brain signals. This interface utilizes electroencephalography (EEG) to translate human intentions regarding specific objects and desired actions directly into commands that robots can execute. We present NOIR 2.0, an enhanced version of NOIR. NOIR 2.0 includes faster and more accurate brain decoding algorithms, which reduce task completion time by 46%. NOIR 2.0 uses few-shot robot learning algorithms to adapt to individual users and predict their intentions. The new learning algorithms leverage foundation models for more sample-efficient learning and adaptation (15 demos vs. a single demo), significantly reducing overall human time by 65%.",
      "published": "2025-11-25T20:56:27Z",
      "authors": [
        "Tasha Kim",
        "Yingke Wang",
        "Hanvit Cho",
        "Alex Hodges"
      ],
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.HC",
        "cs.LG",
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.20848v1",
      "pdf_link": "https://arxiv.org/pdf/2511.20848v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.20848v1",
      "relevance_score": 1
    },
    {
      "title": "Strong nonlinear detectability and moving horizon estimation for nonlinear systems with unknown inputs",
      "summary": "This paper considers state estimation for general nonlinear discrete-time systems subject to measurement noise and possibly unbounded unknown inputs. To approach this problem, we first propose the concept of strong nonlinear detectability. This condition is sufficient and necessary for the existence of unknown input state estimators (UISEs), which reconstruct states from noisy sampled measurements and yield bounded estimation error even for unbounded unknown inputs. Based on the proposed detectability notion, a UISE is designed via a moving horizon estimation strategy using a full-order model as well as past and current measurements. Next, we tighten this detectability notion to design a two-stage MHE-based UISE, which is computationally more efficient than the MHE-based UISE using full-order models. In a simulation example with a plant growth process, both variants of MHE-based UISEs are compared with a conventional MHE to illustrate the merits of the developed methods.",
      "published": "2025-11-28T17:25:45Z",
      "authors": [
        "Yang Guo",
        "Jaime A. Moreno",
        "Stefan Streif"
      ],
      "categories": [
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.23385v1",
      "pdf_link": "https://arxiv.org/pdf/2511.23385v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.23385v1",
      "relevance_score": 1
    },
    {
      "title": "Model Predictive Path Planning in Navier-Stokes Flow with POD-Based Reduced-Order Models",
      "summary": "We present a framework for optimal trajectory generation in flow-driven systems governed by the Navier-Stokes equations, combining a Proper Orthogonal Decomposition (POD) reduced0order model (ROM) with Model Predictive Control (MPC). The approach (i) approximates the velocity field from data via snapshot POD and orthogonal projection, (ii) derives a Galerkin-projected dynamical model in reduced coordinates, and (iii) employs MPC to plan control inputs that steer an agent through the predicted flow while satisfying state and actuation constraints. By leveraging reduced-order modeling, the method enables real-time control in high-dimensional flow environments. Simulations demonstrate accurate flow-field reconstruction and efficient trajectory generation within realistic wind environments.",
      "published": "2025-11-27T05:32:29Z",
      "authors": [
        "Adam Waterman",
        "Martin Guay"
      ],
      "categories": [
        "math.OC",
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.22123v1",
      "pdf_link": "https://arxiv.org/pdf/2511.22123v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.22123v1",
      "relevance_score": 1
    }
  ],
  "search_keywords": [
    "perception-driven control",
    "adaptive control",
    "learning-based control",
    "sensorimotor learning",
    "physical intelligence",
    "robot learning",
    "adaptive robotics",
    "dynamic modeling",
    "sensor fusion",
    "contact-rich manipulation",
    "tactile perception",
    "force control",
    "impedance control",
    "contact dynamics",
    "interaction control",
    "embedded robotics",
    "real-time control",
    "resource-efficient robotics",
    "state estimation",
    "kalman filter",
    "closed-loop control",
    "perception and control",
    "model-based reinforcement learning",
    "uncertain dynamics",
    "multi-modal sensing",
    "actuation feedback"
  ]
}