{
  "last_updated": "2025-11-24T08:31:49.813896",
  "total_papers": 10,
  "papers": [
    {
      "title": "Safe and Optimal Variable Impedance Control via Certified Reinforcement Learning",
      "summary": "Reinforcement learning (RL) offers a powerful approach for robots to learn complex, collaborative skills by combining Dynamic Movement Primitives (DMPs) for motion and Variable Impedance Control (VIC) for compliant interaction. However, this model-free paradigm often risks instability and unsafe exploration due to the time-varying nature of impedance gains. This work introduces Certified Gaussian Manifold Sampling (C-GMS), a novel trajectory-centric RL framework that learns combined DMP and VIC policies while guaranteeing Lyapunov stability and actuator feasibility by construction. Our approach reframes policy exploration as sampling from a mathematically defined manifold of stable gain schedules. This ensures every policy rollout is guaranteed to be stable and physically realizable, thereby eliminating the need for reward penalties or post-hoc validation. Furthermore, we provide a theoretical guarantee that our approach ensures bounded tracking error even in the presence of bounded model errors and deployment-time uncertainties. We demonstrate the effectiveness of C-GMS in simulation and verify its efficacy on a real robot, paving the way for reliable autonomous interaction in complex environments.",
      "published": "2025-11-20T13:10:42Z",
      "authors": [
        "Shreyas Kumar",
        "Ravi Prakash"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.16330v1",
      "pdf_link": "https://arxiv.org/pdf/2511.16330v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.16330v1",
      "relevance_score": 3
    },
    {
      "title": "DynaMimicGen: A Data Generation Framework for Robot Learning of Dynamic Tasks",
      "summary": "Learning robust manipulation policies typically requires large and diverse datasets, the collection of which is time-consuming, labor-intensive, and often impractical for dynamic environments. In this work, we introduce DynaMimicGen (D-MG), a scalable dataset generation framework that enables policy training from minimal human supervision while uniquely supporting dynamic task settings. Given only a few human demonstrations, D-MG first segments the demonstrations into meaningful sub-tasks, then leverages Dynamic Movement Primitives (DMPs) to adapt and generalize the demonstrated behaviors to novel and dynamically changing environments. Improving prior methods that rely on static assumptions or simplistic trajectory interpolation, D-MG produces smooth, realistic, and task-consistent Cartesian trajectories that adapt in real time to changes in object poses, robot states, or scene geometry during task execution. Our method supports different scenarios - including scene layouts, object instances, and robot configurations - making it suitable for both static and highly dynamic manipulation tasks. We show that robot agents trained via imitation learning on D-MG-generated data achieve strong performance across long-horizon and contact-rich benchmarks, including tasks like cube stacking and placing mugs in drawers, even under unpredictable environment changes. By eliminating the need for extensive human demonstrations and enabling generalization in dynamic settings, D-MG offers a powerful and efficient alternative to manual data collection, paving the way toward scalable, autonomous robot learning.",
      "published": "2025-11-20T10:47:57Z",
      "authors": [
        "Vincenzo Pomponi",
        "Paolo Franceschi",
        "Stefano Baraldo",
        "Loris Roveda",
        "Oliver Avram",
        "Luca Maria Gambardella",
        "Anna Valente"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.16223v1",
      "pdf_link": "https://arxiv.org/pdf/2511.16223v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.16223v1",
      "relevance_score": 3
    },
    {
      "title": "InEKFormer: A Hybrid State Estimator for Humanoid Robots",
      "summary": "Humanoid robots have great potential for a wide range of applications, including industrial and domestic use, healthcare, and search and rescue missions. However, bipedal locomotion in different environments is still a challenge when it comes to performing stable and dynamic movements. This is where state estimation plays a crucial role, providing fast and accurate feedback of the robot's floating base state to the motion controller. Although classical state estimation methods such as Kalman filters are widely used in robotics, they require expert knowledge to fine-tune the noise parameters. Due to recent advances in the field of machine learning, deep learning methods are increasingly used for state estimation tasks. In this work, we propose the InEKFormer, a novel hybrid state estimation method that incorporates an invariant extended Kalman filter (InEKF) and a Transformer network. We compare our method with the InEKF and the KalmanNet approaches on datasets obtained from the humanoid robot RH5. The results indicate the potential of Transformers in humanoid state estimation, but also highlight the need for robust autoregressive training in these high-dimensional problems.",
      "published": "2025-11-20T12:35:56Z",
      "authors": [
        "Lasse Hohmeyer",
        "Mihaela Popescu",
        "Ivan Bergonzani",
        "Dennis Mronga",
        "Frank Kirchner"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.16306v1",
      "pdf_link": "https://arxiv.org/pdf/2511.16306v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.16306v1",
      "relevance_score": 2
    },
    {
      "title": "UltraDP: Generalizable Carotid Ultrasound Scanning with Force-Aware Diffusion Policy",
      "summary": "Ultrasound scanning is a critical imaging technique for real-time, non-invasive diagnostics. However, variations in patient anatomy and complex human-in-the-loop interactions pose significant challenges for autonomous robotic scanning. Existing ultrasound scanning robots are commonly limited to relatively low generalization and inefficient data utilization. To overcome these limitations, we present UltraDP, a Diffusion-Policy-based method that receives multi-sensory inputs (ultrasound images, wrist camera images, contact wrench, and probe pose) and generates actions that are fit for multi-modal action distributions in autonomous ultrasound scanning of carotid artery. We propose a specialized guidance module to enable the policy to output actions that center the artery in ultrasound images. To ensure stable contact and safe interaction between the robot and the human subject, a hybrid force-impedance controller is utilized to drive the robot to track such trajectories. Also, we have built a large-scale training dataset for carotid scanning comprising 210 scans with 460k sample pairs from 21 volunteers of both genders. By exploring our guidance module and DP's strong generalization ability, UltraDP achieves a 95% success rate in transverse scanning on previously unseen subjects, demonstrating its effectiveness.",
      "published": "2025-11-19T15:40:22Z",
      "authors": [
        "Ruoqu Chen",
        "Xiangjie Yan",
        "Kangchen Lv",
        "Gao Huang",
        "Zheng Li",
        "Xiang Li"
      ],
      "categories": [
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.15550v2",
      "pdf_link": "https://arxiv.org/pdf/2511.15550v2.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.15550v2",
      "relevance_score": 1
    },
    {
      "title": "Harnessing Data from Clustered LQR Systems: Personalized and Collaborative Policy Optimization",
      "summary": "It is known that reinforcement learning (RL) is data-hungry. To improve sample-efficiency of RL, it has been proposed that the learning algorithm utilize data from 'approximately similar' processes. However, since the process models are unknown, identifying which other processes are similar poses a challenge. In this work, we study this problem in the context of the benchmark Linear Quadratic Regulator (LQR) setting. Specifically, we consider a setting with multiple agents, each corresponding to a copy of a linear process to be controlled. The agents' local processes can be partitioned into clusters based on similarities in dynamics and tasks. Combining ideas from sequential elimination and zeroth-order policy optimization, we propose a new algorithm that performs simultaneous clustering and learning to output a personalized policy (controller) for each cluster. Under a suitable notion of cluster separation that captures differences in closed-loop performance across systems, we prove that our approach guarantees correct clustering with high probability. Furthermore, we show that the sub-optimality gap of the policy learned for each cluster scales inversely with the size of the cluster, with no additional bias, unlike in prior works on collaborative learning-based control. Our work is the first to reveal how clustering can be used in data-driven control to learn personalized policies that enjoy statistical gains from collaboration but do not suffer sub-optimality due to inclusion of data from dissimilar processes. From a distributed implementation perspective, our method is attractive as it incurs only a mild logarithmic communication overhead.",
      "published": "2025-11-21T18:45:53Z",
      "authors": [
        "Vinay Kanakeri",
        "Shivam Bajaj",
        "Ashwin Verma",
        "Vijay Gupta",
        "Aritra Mitra"
      ],
      "categories": [
        "cs.LG",
        "eess.SY",
        "math.OC"
      ],
      "link": "https://arxiv.org/abs/2511.17489v1",
      "pdf_link": "https://arxiv.org/pdf/2511.17489v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.17489v1",
      "relevance_score": 1
    },
    {
      "title": "A Framework for Adaptive Stabilisation of Nonlinear Stochastic Systems",
      "summary": "We consider the adaptive control problem for discrete-time, nonlinear stochastic systems with linearly parameterised uncertainty. Assuming access to a parameterised family of controllers that can stabilise the system in a bounded set within an informative region of the state space when the parameter is well-chosen, we propose a certainty equivalence learning-based adaptive control strategy, and subsequently derive stability bounds on the closed-loop system that hold for some probabilities. We then show that if the entire state space is informative, and the family of controllers is globally stabilising with appropriately chosen parameters, high probability stability guarantees can be derived.",
      "published": "2025-11-21T17:33:00Z",
      "authors": [
        "Seth Siriya",
        "Jingge Zhu",
        "Dragan Nešić",
        "Ye Pu"
      ],
      "categories": [
        "eess.SY",
        "cs.LG",
        "math.OC"
      ],
      "link": "https://arxiv.org/abs/2511.17436v1",
      "pdf_link": "https://arxiv.org/pdf/2511.17436v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.17436v1",
      "relevance_score": 1
    },
    {
      "title": "Incorporating Bayesian Transfer Learning into Particle Filter for Dual-Tracking System with Asymmetric Noise Intensities",
      "summary": "Using Bayesian transfer learning, we develop a particle filter approach for tracking a nonlinear dynamical model in a dual-tracking system where intensities of measurement noise for both sensors are asymmetric. The densities for Bayesian transfer learning are approximated with the sum of weighted particles to improve the tracking performance of the primary sensor, which experiences a higher noise intensity compared to the source sensor. We present simulation results that validate the effectiveness of the proposed approach compared to an isolated particle filter and transfer learning applied to the unscented Kalman filter and the cubature Kalman filter. Furthermore, increasing the number of particles shows an improvement in the performance of transfer learning applied to the particle filter with a higher rate compared to the isolated particle filter. However, increasing the number of particles raises computational time per step. Moreover, the performance gain from incorporating Bayesian transfer learning is approximately linearly proportional to the absolute difference value between the noise intensities of the sensors in the dual-tracking system.",
      "published": "2025-11-21T17:39:09Z",
      "authors": [
        "Omar A. Alotaibi",
        "Brian L. Mark",
        "Mohammad Reza Fasihi"
      ],
      "categories": [
        "eess.SP",
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.17440v1",
      "pdf_link": "https://arxiv.org/pdf/2511.17440v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.17440v1",
      "relevance_score": 1
    },
    {
      "title": "Generative MIMO Beam Map Construction for Location Recovery and Beam Tracking",
      "summary": "Machine learning (ML) has greatly advanced data-driven channel modeling and resource optimization in wireless communication systems. However, most existing ML-based methods rely on large, accurately labeled datasets with location information, which are often difficult and costly to obtain. This paper proposes a generative framework to recover location labels directly from sequences of sparse channel state information (CSI) measurements, without explicit location labels for radio map construction. Instead of directly storing raw CSI, we learn a compact low-dimensional radio map embedding and leverage a generative model to reconstruct the high-dimensional CSI. Specifically, to address the uncertainty of sparse CSI, a dual-scale feature extraction scheme is designed to enhance feature representation by jointly exploiting correlations from angular space and across neighboring samples. We develop a hybrid recurrent-convolutional encoder to learn mobility patterns, which combines a truncation strategy and multi-scale convolutions in the recurrent neural network (RNN) to ensure feature robustness against short-term fluctuations. Unlike conventional Gaussian priors in latent space, we embed a learnable radio map to capture the location information by encoding high-level positional features from CSI measurements. Finally, a diffusion-based generative decoder reconstructs the full CSI with high fidelity by conditioning on the positional features in the radio map. Numerical experiments demonstrate that the proposed model can improve localization accuracy by over 30% and achieve a 20% capacity gain in non-line-of-sight (NLOS) scenarios compared with model-based Kalman filter approaches.",
      "published": "2025-11-21T07:25:49Z",
      "authors": [
        "Wangqian Chen",
        "Junting Chen",
        "Shuguang Cui"
      ],
      "categories": [
        "eess.SP",
        "cs.LG",
        "eess.SY"
      ],
      "link": "https://arxiv.org/abs/2511.17007v1",
      "pdf_link": "https://arxiv.org/pdf/2511.17007v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.17007v1",
      "relevance_score": 1
    },
    {
      "title": "Generative Modeling of Clinical Time Series via Latent Stochastic Differential Equations",
      "summary": "Clinical time series data from electronic health records and medical registries offer unprecedented opportunities to understand patient trajectories and inform medical decision-making. However, leveraging such data presents significant challenges due to irregular sampling, complex latent physiology, and inherent uncertainties in both measurements and disease progression. To address these challenges, we propose a generative modeling framework based on latent neural stochastic differential equations (SDEs) that views clinical time series as discrete-time partial observations of an underlying controlled stochastic dynamical system. Our approach models latent dynamics via neural SDEs with modality-dependent emission models, while performing state estimation and parameter learning through variational inference. This formulation naturally handles irregularly sampled observations, learns complex non-linear interactions, and captures the stochasticity of disease progression and measurement noise within a unified scalable probabilistic framework. We validate the framework on two complementary tasks: (i) individual treatment effect estimation using a simulated pharmacokinetic-pharmacodynamic (PKPD) model of lung cancer, and (ii) probabilistic forecasting of physiological signals using real-world intensive care unit (ICU) data from 12,000 patients. Results show that our framework outperforms ordinary differential equation and long short-term memory baseline models in accuracy and uncertainty estimation. These results highlight its potential for enabling precise, uncertainty-aware predictions to support clinical decision-making.",
      "published": "2025-11-20T14:50:49Z",
      "authors": [
        "Muhammad Aslanimoghanloo",
        "Ahmed ElGazzar",
        "Marcel van Gerven"
      ],
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "link": "https://arxiv.org/abs/2511.16427v1",
      "pdf_link": "https://arxiv.org/pdf/2511.16427v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.16427v1",
      "relevance_score": 1
    },
    {
      "title": "Artificial intelligence approaches for energy-efficient laser cutting machines",
      "summary": "This research addresses the significant challenges of energy consumption and environmental impact in laser cutting by proposing novel deep learning (DL) methodologies to achieve energy reduction. Recognizing the current lack of adaptive control and the open-loop nature of CO2 laser suction pumps, this study utilizes closed-loop configurations that dynamically adjust pump power based on both the material being cut and the smoke level generated. To implement this adaptive system, diverse material classification methods are introduced, including techniques leveraging lens-less speckle sensing with a customized Convolutional Neural Network (CNN) and an approach using a USB camera with transfer learning via the pre-trained VGG16 CNN model. Furthermore, a separate DL model for smoke level detection is employed to simultaneously refine the pump's power output. This integration prompts the exhaust suction pump to automatically halt during inactive times and dynamically adjust power during operation, leading to experimentally proven and remarkable energy savings, with results showing a 20% to 50% reduction in the smoke suction pump's energy consumption, thereby contributing substantially to sustainable development in the manufacturing sector.",
      "published": "2025-11-18T22:25:58Z",
      "authors": [
        "Mohamed Abdallah Salem",
        "Hamdy Ahmed Ashour",
        "Ahmed Elshenawy"
      ],
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG",
        "cs.RO"
      ],
      "link": "https://arxiv.org/abs/2511.14952v1",
      "pdf_link": "https://arxiv.org/pdf/2511.14952v1.pdf",
      "source": "ArXiv",
      "arxiv_id": "2511.14952v1",
      "relevance_score": 1
    }
  ],
  "search_keywords": [
    "perception-driven control",
    "adaptive control",
    "learning-based control",
    "sensorimotor learning",
    "physical intelligence",
    "robot learning",
    "adaptive robotics",
    "dynamic modeling",
    "sensor fusion",
    "contact-rich manipulation",
    "tactile perception",
    "force control",
    "impedance control",
    "contact dynamics",
    "interaction control",
    "embedded robotics",
    "real-time control",
    "resource-efficient robotics",
    "state estimation",
    "kalman filter",
    "closed-loop control",
    "perception and control",
    "model-based reinforcement learning",
    "uncertain dynamics",
    "multi-modal sensing",
    "actuation feedback"
  ]
}